mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
/*                      \\\|///
                        \\  - -  //
                         (  @ @  )
  /--------------------oOOo-(_)-oOOo---------------------\
  |                                                      |
  |                                                      |
  |    Transistor Tester for Arduino (version 1.08a)     |
  |                                                      |
  |  based on code: Karl-Heinz Kubbeler (version 1.08k)  |
  |                                                      |
  |                                                      |
  |                            Oooo                      |
  \--------------------oooO----(   )---------------------/
                     (   )    ) /
                        \ (    (_/
                         \_)                            */

#include <Arduino.h>
#include <avr/io.h>
#include <util/delay.h>
#include <avr/sleep.h>
#include <stdlib.h>
#include <string.h>
#include <avr/eeprom.h>
#include <avr/pgmspace.h>
#include <avr/wdt.h>
#include <avr/interrupt.h>
#include <math.h>
#include <stdint.h>
#include <avr/power.h>
#include <Wire.h> 


#include <LiquidCrystal_I2C.h>
LiquidCrystal_I2C lcd(0x3F, 16, 2);  //LiquidCrystal_I2C lcd(0x27, 16, 2);


int16_t ifc, ifi,ipi;


unsigned int blinkMillis;
unsigned int buttonMillis;

int val = 0,base;
byte i = 0;
int prev_x = 0, prev_y = 0;
bool ExecSerialTx = false; // send scans to PC
bool SendAdcValues = false; // send ADC values to PC

const int pin_PUSHBUT     =  0;  // PUSH-Button     RX-Pin
//const int pin_PUSHBUT     =  2;  // PUSH-Button     ISR-Pin
//const int pin_ADC_SW      =  6;  // D6 connect ADC0,1,2 with TP1,2,3
const int pin_ADC_SW      = 17;  // A3 connect ADC0,1,2 with TP1,2,3
const int pin_ADC_12V     = 21;  // A7
  
const unsigned long TimeoutPeriod = 60000;

volatile int8_t s_isr = 0, s_isr1, s_isr2, s_two1, s_rota1 = 0,s_auto=0,s_vgs=0;
volatile long time_l = 0, time1_o = 0, times_n, times_o = 0;
unsigned long seconds = 1000L; //Notice the L
unsigned long minutes = seconds * 60;


// be careful using these inside if statements:
//#define SerialPrint(s) {if (ExecSerialTx) Serial.print(s);}
//#define SerialPrintLn(s) {if (ExecSerialTx) Serial.println(s);}

int8_t s_min,s_max,s_sum,error_i=0,s_test=1;
//---------------0,         1,     2,      3,         4,         5,       6,      7,         8
enum TkindDUT {tkNothing, tkPNP, tkNPN, tkPMOSFET, tkNMOSFET, tkPJFET, tkNJFET, tkPDiode, tkNDiode};
TkindDUT curkind;
uint8_t kind_nr = curkind;
enum TclassDUT {tcBipolar, tcMOSFET, tcJFET}; // 0,1,2
TclassDUT CurDUTclass = tcBipolar;

char intface_t[] = {' ','N','D','E','B','C','X'};
             
int8_t sw1,sw2,sw3;

volatile int8_t s_switch=0;

int imax = 480;
int icr=0,uce=0,uop=0,u12=0;

// ******** config options for your Semiconductor tester

// Every changing of this Makefile will result in new compiling the whole
// programs, if you call make or make upload.

#define MCU atmega328p
#define F_CPU 16000000UL

// Select your language:
// Available languages are: LANG_ENGLISH, LANG_GERMAN, LANG_POLISH, LANG_CZECH, LANG_SLOVAK, LANG_SLOVENE,
//                          LANG_DUTCH, LANG_BRASIL, LANG_RUSSIAN, LANG_UKRAINIAN
//#define LANG_ENGLISH
#define LANG_GERMAN
// The LCD_CYRILLIC option is necessary, if you have a display with cyrillic characterset.
// This lcd-display don't have a character for Ohm and for u (micro).
// Russian language requires a LCD controller with russian characterset and option LCD_CYRILLIC!
//#define LCD_CYRILLIC

// The LCD_DOGM option must be set for support of the DOG-M type of LCD modules with ST7036 controller.
// For this LCD type the contrast must be set with software command.
//#define LCD_DOGM


// The WITH_SELFTEST option enables selftest function (only for mega168 or mega328).
//#define WITH_SELFTEST

// AUTO_CAL will enable the autocalibration of zero offset of capacity measurement and
// also the port output resistance values will be find out in SELFTEST section.
// With a external capacitor a additionally correction of reference voltage is figured out for 
// low capacity measurement and also for the AUTOSCALE_ADC measurement.
// The AUTO_CAL option is only selectable for mega168 and mega328.
//#define AUTO_CAL

// FREQUENCY_50HZ enables a 50 Hz frequency generator for up to one minute at the end of selftests.
//#define FREQUENCY_50HZ

// The WITH_AUTO_REF option enables reading of internal REF-voltage to get factors for the Capacity measuring.
#define WITH_AUTO_REF
// REF_C_KORR corrects the reference Voltage for capacity measurement (<40uF) and has mV units.
// Greater values gives lower capacity results.
#define REF_C_KORR 12
// REF_L_KORR corrects the reference Voltage for inductance measurement and has mV units.
#define REF_L_KORR 40
// C_H_KORR defines a correction of 0.1% units for big capacitor measurement.
// Positive values will reduce measurement results.
#define C_H_KORR 0

// The WITH_UART option enables the software UART (TTL level output at Pin PC3, 26).
// If the option is deselected, PC3 can be used as external voltage input with a
// 10:1 resistor divider.
//#define WITH_UART

// The CAP_EMPTY_LEVEL  defines the empty voltage level for capacitors in mV.
// Choose a higher value, if your Tester reports "Cell!" by unloading capacitors.
#define CAP_EMPTY_LEVEL 4

// The AUTOSCALE_ADC option enables the autoscale ADC (ADC use VCC and Bandgap Ref).
#define AUTOSCALE_ADC
#define REF_R_KORR 3

// The ESR_ZERO value define the zero value of ESR measurement (units = 0.01 Ohm).
//#define ESR_ZERO 29
#define ESR_ZERO 20

// NO_AREF_CAP tells your Software, that you have no Capacitor installed at pin AREF (21).
// This enables a shorter wait-time for AUTOSCALE_ADC function.
// A capacitor with 1nF can be used with the option NO_AREF_CAP set.
#define NO_AREF_CAP

// The OP_MHZ option tells the software the Operating Frequency of your ATmega.
// OP_MHZ 16

