mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
const unsigned char PinRLtab[] PROGMEM = { (1<<(TP1*2)), (1<<(TP2*2)), (1<<(TP3*2))};  // Table of commands to switch the  R-L resistors Pin 0,1,2
const unsigned char PinADCtab[] PROGMEM = { (1<<TP1), (1<<TP2), (1<<TP3)};  // Table of commands to switch the ADC-Pins 0,1,2

/*
// generate Omega- and u-character as Custom-character, if these characters has a number of loadable type
#if LCD_CHAR_OMEGA < 8
  const unsigned char CyrillicOmegaIcon[] MEM_TEXT = {0,0,14,17,17,10,27,0};  // Omega
#endif
#if LCD_CHAR_U < 8
  const unsigned char CyrillicMuIcon[] MEM_TEXT = {0,17,17,17,19,29,16,16}; // micro
#endif
*/

#ifdef AUTO_CAL
  //const uint16_t R680pl EEMEM = R_L_VAL+PIN_RP; // total resistor to VCC
  //const uint16_t R680mi EEMEM = R_L_VAL+PIN_RM; // total resistor to GND
  const int8_t RefDiff EEMEM = REF_R_KORR;    // correction of internal Reference Voltage
#endif

const uint8_t PrefixTab[] MEM_TEXT = { 'p','n',LCD_CHAR_U,'m',0,'k','M'};  // p,n,u,m,-,k,M

#ifdef AUTO_CAL
  //const uint16_t cap_null EEMEM = C_NULL; // Zero offset of capacity measurement 
  const int16_t ref_offset EEMEM = REF_C_KORR;  // default correction of internal reference voltage for capacity measurement
  // LoPin:HiPin                        2:1    3:1    1:2                    :     3:2                   1:3    2:3
  const uint8_t c_zero_tab[] EEMEM = { C_NULL,C_NULL,C_NULL+TP2_CAP_OFFSET,C_NULL,C_NULL+TP2_CAP_OFFSET,C_NULL,C_NULL }; // table of zero offsets
#endif

const uint8_t EE_ESR_ZEROtab[] PROGMEM = {ESR_ZERO, ESR_ZERO, ESR_ZERO, ESR_ZERO};  // zero offset of ESR measurement

// End of EEPROM-Strings

// Multiplier for capacity measurement with R_H (470KOhm)
unsigned int RHmultip = DEFAULT_RH_FAKT;


#else
  // no MAIN_C
  #define COMMON extern
  #ifdef WITH_SELFTEST
    extern const unsigned char SELFTEST[] MEM_TEXT;
    extern const unsigned char RELPROBE[] MEM_TEXT;
    extern const unsigned char ATE[] MEM_TEXT;
  #endif

  #ifdef AUTO_CAL
    //extern uint16_t R680pl;
    //extern uint16_t R680mi;
    extern int8_t RefDiff;
    extern uint16_t ref_offset;
    extern uint8_t c_zero_tab[];
  #endif

  extern const uint8_t EE_ESR_ZEROtab[] EEMEM;  // zero offset of ESR measurement
  extern const uint16_t RLtab[];

  #if FLASHEND > 0x1fff
    extern uint16_t LogTab[];
    extern const unsigned char ESR_str[];
  #endif

  #ifdef AUTO_RH
    extern const uint16_t RHtab[];
  #endif

  extern const unsigned char PinRLtab[];
  extern const unsigned char PinADCtab[];
  extern unsigned int RHmultip;

#endif  // MAIN_C


struct Diode_t {
  uint8_t Anode;
  uint8_t Cathode;
  unsigned int Voltage;
};

COMMON struct Diode_t diodes[6];
COMMON uint8_t NumOfDiodes;

COMMON struct {
  unsigned long hfe[2];   // current amplification factor 
  unsigned int uBE[2];    // B-E-voltage of the Transistor
  uint8_t b,c,e;    // pins of the Transistor
}trans;

COMMON unsigned int gthvoltage; // Gate-threshold voltage 

COMMON uint8_t PartReady; // part detection is finished 
COMMON uint8_t PartMode;
COMMON uint8_t tmpval, tmpval2;
COMMON unsigned int ref_mv;     // Reference-voltage  in mV units

COMMON struct resis_t{
  unsigned long rx;   // value of resistor RX  
  #if FLASHEND > 0x1fff
    unsigned long lx;   // inductance 10uH or 100uH
    int8_t lpre;    // prefix for inductance
  #endif
  uint8_t ra,rb;    // Pins of RX
  uint8_t rt;     // Tristate-Pin (inactive)
} resis[3];

COMMON uint8_t ResistorsFound;  // Number of found resistors
COMMON uint8_t ii;    // multipurpose counter

COMMON struct cap_t {
  unsigned long cval;   // capacitor value 
  unsigned long cval_max; // capacitor with maximum value
  union t_combi{
  unsigned long dw;   // capacity value without corrections
  uint16_t w[2];
  } cval_uncorrected;
  #if FLASHEND > 0x1fff
    unsigned int esr;   // serial resistance of C in 0.01 Ohm
    unsigned int v_loss;  // voltage loss 0.1%
  #endif
  uint8_t ca, cb;   // pins of capacitor
  int8_t cpre;      // Prefix for capacitor value  -12=p, -9=n, -6=u, -3=m
  int8_t cpre_max;    // Prefix of the biggest capacitor
} cap;

#ifndef INHIBIT_SLEEP_MODE
  // with sleep mode we need a global ovcnt16
  COMMON volatile uint16_t ovcnt16;
  COMMON volatile uint8_t unfinished;
#endif

COMMON int16_t load_diff; // difference voltage of loaded capacitor and internal reference

COMMON uint8_t WithReference; // Marker for found precision voltage reference = 1
COMMON uint8_t PartFound; // the found part 
COMMON char outval[12];   // String for ASCII-outpu
COMMON uint8_t empty_count; // counter for max count of empty measurements
COMMON uint8_t mess_count;  // counter for max count of nonempty measurements

COMMON struct ADCconfig_t {
  uint8_t Samples;    // number of ADC samples to take
  uint8_t RefFlag;    // save Reference type VCC of IntRef
  uint16_t U_Bandgap;   // Reference Voltage in mV
  uint16_t U_AVCC;    // Voltage of AVCC
} ADCconfig;

#ifdef AUTO_CAL
  COMMON uint8_t pin_combination; // coded Pin-combination  2:1,3:1,1:2,x:x,3:2,1:3,2:3
  COMMON uint16_t resis680pl; // port output resistance + 680
  COMMON uint16_t resis680mi; // port output resistance + 680
  COMMON uint16_t pin_rmi;  // port output resistance to GND side, 0.1 Ohm units
  COMMON uint16_t pin_rpl;  // port output resistance to VCC side, 0.1 Ohm units
#endif

#if POWER_OFF+0 > 1
  COMMON unsigned int display_time; // display time of measurement in ms units
#endif

/* -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- */

// definitions of parts
#define PART_NONE 0
#define PART_DIODE 1
#define PART_TRANSISTOR 2
#define PART_FET 3
#define PART_TRIAC 4
#define PART_THYRISTOR 5
#define PART_RESISTOR 6
#define PART_CAPACITOR 7
#define PART_CELL 8   // 8######################################################################

