mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
  delay(200);

  InitTranTester();        //##########
  delay(500);
  
} 



void expPins(int8_t tt_ct_mode) {
 
  if (tt_ct_mode == 1) {  // TranTester
    // disconnect matrix
    pinMode(2,INPUT);   
    pinMode(3,INPUT);
    pinMode(4,INPUT);
    pinMode(5,INPUT);
    pinMode(6,INPUT);  
    pinMode(7,INPUT);
    pinMode(9,INPUT);  // ??
    pinMode(11,INPUT); // ??
    pinMode(13,INPUT); // ??      
    delay(10);
    digitalWrite(pin_ADC_SW,HIGH);  // connect TP1,2,3 with ADC0,1,2
    delay(40);
      
  }
  if (tt_ct_mode == 2) {  // CurveTracer
  // Serial.println(2);
    digitalWrite(pin_ADC_SW,LOW);
    delay(40);
      
  }
}



 
void InitTranTester() { 
  
  lcd.begin();lcd.backlight();
 
  lcd_pgm_custom_char(LCD_CHAR_DIODE1, DiodeIcon1);  // Custom-Character Diode symbol >|
  lcd_pgm_custom_char(LCD_CHAR_DIODE2, DiodeIcon2);  // Custom-Character Diode symbol |<
  lcd_pgm_custom_char(LCD_CHAR_CAP,    CapIcon);     // Custom-Character Capacitor symbol ||
  lcd_pgm_custom_char(LCD_CHAR_RESIS1, ResIcon1);    // Custom-Character Resistor symbol [
  lcd_pgm_custom_char(LCD_CHAR_RESIS2, ResIcon2);    // Custom-Character Resistor symbol ]
  lcd_pgm_custom_char(LCD_CHAR_OMEGA,  OmegaIcon);   // load Omega as Custom-Character
  lcd_pgm_custom_char(LCD_CHAR_U,      MicroIcon);   // load Micro as Custom-Character
  lcd_home();
  
  lcd_string("TransistorTester");
  lcd_set_cursor(1, 0);
  lcd_string("for Arduino 1.08");
/*
  ON_DDR = 1;
 // ON_PORT = 1;   //??0? 0 for no i2c-Displays


  // switch on
  ON_DDR = (1<<ON_PIN);     // switch to output
  ON_PORT = (1<<ON_PIN)|(1<<RST_PIN);   // switch power on , enable internal Pullup for Start-Pin

*/
  // ADC-Init
  ADCSRA = (1<<ADEN) | AUTO_CLOCK_DIV;  // prescaler=8 or 64 (if 8Mhz clock)

#define WDRF_HOME MCUSR

#define T2_PERIOD (1024 / (F_CPU / 1000000UL)); // set to 128 or 64 us 
  

  if(tmp) { 
    // check if Watchdog-Event 
    // this happens, if the Watchdog is not reset for 2s
    // can happen, if any loop in the Program doen't finish.
    lcd_line1();
    lcd_fix_string(TestTimedOut); // Output Timeout
    wait_about3s();     // wait for 3 s
  }

// DIDR0 = 0x3f;   // disable all Input register of ADC

#define display_time OFF_WAIT_TIME

  empty_count = 0;
  mess_count = 0;
}

void batCheck()  { // Battery check is selected
   
    ReadADC(TPBAT);     // Dummy-Readout
    trans.uBE[0] = W5msReadADC(TPBAT);  // with 5V reference
    lcd_fix_string(Bat_str);    // output: "Bat. "

    #ifdef BAT_OUT
      // display Battery voltage
      // The divisor to get the voltage in 0.01V units is ((10*33)/133) witch is about 2.4812
      // A good result can be get with multiply by 4 and divide by 10 (about 0.75%).
      //cap.cval = (trans.uBE[0]*4)/10+((BAT_OUT+5)/10); // usually output only 2 digits
      //DisplayValue(cap.cval,-2,'V',2);    // Display 2 Digits of this 10mV units
      cap.cval = (trans.uBE[0]*4)+BAT_OUT;    // usually output only 2 digits
      DisplayValue(cap.cval,-3,'V',2);      // Display 2 Digits of this 10mV units
      lcd_space();
    #endif

    #if (BAT_POOR > 12000)
      #warning "Battery POOR level is set very high!"
    #endif
    #if (BAT_POOR < 2500)
      #warning "Battery POOR level is set very low!"
    #endif

    #if (BAT_POOR > 5300)
      // use .8 V difference to Warn-Level
      #define WARN_LEVEL (((unsigned long)(BAT_POOR+800)*(unsigned long)33)/133)
    #elif (BAT_POOR > 3249)
      // less than 5.4 V only .4V difference to Warn-Level
      #define WARN_LEVEL (((unsigned long)(BAT_POOR+400)*(unsigned long)33)/133)
    #elif (BAT_POOR > 1299)
      // less than 2.9 V only .2V difference to Warn-Level
      #define WARN_LEVEL (((unsigned long)(BAT_POOR+200)*(unsigned long)33)/133)
    #else
      // less than 1.3 V only .1V difference to Warn-Level
      #define WARN_LEVEL (((unsigned long)(BAT_POOR+100)*(unsigned long)33)/133)
    #endif

    #define POOR_LEVEL (((unsigned long)(BAT_POOR)*(unsigned long)33)/133)

    // check the battery voltage
    if (trans.uBE[0] <  WARN_LEVEL) {

      // Vcc < 7,3V; show Warning 
      if(trans.uBE[0] < POOR_LEVEL) { 
        // Vcc <6,3V; no proper operation is possible
        lcd_fix_string(BatEmpty); // Battery empty!
        wait_about2s();
        PORTD = 0;      // switch power off
        return;
      }

      lcd_fix_string(BatWeak);    // Battery weak
    } else { // Battery-voltage OK
      lcd_fix_string(OK_str);     // "OK"
    }

  
}
 


void loop()
{
    digitalWrite(pin_ADC_SW,LOW);
    TranTest();                    // detect device-type and pin assignment
    digitalWrite(pin_ADC_SW,LOW);  // disconnect ADC0,1,2 from TP1,TP2,TP3
    if (kind_nr > 0) {             // for CurveTracer: connect TP1,TP2,TP3 to E,B or C
      switchMatrix(kind_nr,intface_t[3],intface_t[4],intface_t[5]);  // 0....8, Pin1, Pin2, Pin3(E,B,C etc.)
  /*    uart_putx(sw1+48);    // Pin: 1...9 int(0...9) to ascii
      uart_putx('\n');
      uart_putx(sw2+48);    // Pin: 1...9 int(0...9) to ascii
      uart_putx('\n');
      uart_putx(sw3+48);    // Pin: 1...9 int(0...9) to ascii
      uart_putx('\n'); */
      disconnectPins_EBC();
      delay(2000);
    }  
 

}  // end loop(

void  TranTest() {
  
start:
  s_switch = 0;
  s_vgs = 0;
  lcd_clear();
  lcd_string("TranTester start");
 
  lcd_set_cursor(1, 0);
  lcd_string("press pushbutton");
  delay(1000);
    
  int s_button = 1;
  while(s_button==1) {
    
    s_button = digitalRead(pin_PUSHBUT);
    delay(10);
  }
  lcd_set_cursor(1, 0);
  lcd_string("T.tester started");
  delay(2000);
  lcd_clear();
 
  
  
  
  kind_nr      = 0;
  intface_t[0] = ' ';
  PartFound    = PART_NONE; // no part found
  NumOfDiodes  = 0;         // Number of diodes = 0
  PartReady    = 0;
  PartMode     = 0;
  for (int8_t ilx=0;ilx<6;ilx++) {
    intface_t[ilx] = ' ';
    pinMode(ilx+2,INPUT);   // open switches in matrix
  }
  
