mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
  digitalWrite(pin_ADC_SW,HIGH);// connect TP1,2,3 with ADC0,1,2
  delay(40);
  
  WithReference = 0;    // no precision reference voltage
  ADC_DDR = TXD_MSK;    // activate Software-UART 
  ResistorsFound = 0;   // no resistors found
  cap.ca = 0;
  cap.cb = 0;

 #ifdef WITH_UART
  // uart_newline();   // start of new measurement  //nl
 #endif

  ADCconfig.RefFlag = 0;
  Calibrate_UR();   // get Ref Voltages and Pin resistance
  lcd_line1();      // 1 row 
  
  ADCconfig.U_Bandgap = ADC_internal_reference;  // set internal reference voltage for ADC

 #ifdef BAT_CHECK   // Battery check is selected
  batCheck();
 #else
    lcd_fix2_string(VERSION_str); // if no Battery check, Version 1.08 ... in row 1
 #endif   // end BAT_CHECK

 #ifdef WDT_enabled
    //wdt_enable(WDTO_2S);    // Watchdog on
 #endif

  //wait_about1s();     // add more time for reading batterie voltage

  // begin tests

  #ifdef AUTO_RH
    RefVoltage();     // compute RHmultip = f(reference voltage)
  #endif

  #if FLASHEND > 0x1fff
    if (WithReference) {
      // 2.5V precision reference is checked OK
      if ((mess_count == 0) && (empty_count == 0)) {
        // display VCC= only first time
        lcd_line2();
        lcd_fix_string(VCC_str);      // VCC=
        DisplayValue(ADCconfig.U_AVCC,-3,'V',3);  // Display 3 Digits of this mV units
        //lcd_space();
        //DisplayValue(RRpinMI,-1,LCD_CHAR_OMEGA,4);
        wait_about1s();
      }
    }
  #endif  // FLASHEND

  #ifdef WITH_VEXT
    // show the external voltage
    while (!(ON_PIN_REG & (1<<RST_PIN))) {
      lcd_line2();
      lcd_clear_line();
      lcd_line2();
      lcd_fix_string(Vext_str);     // Vext=
      ADC_DDR = 0;        // deactivate Software-UART
      trans.uBE[1] = W5msReadADC(TPext);  // read external voltage 
      ADC_DDR = TXD_MSK;      // activate Software-UART 

      #ifdef WITH_UART
       // uart_newline();   // start of new measurement //nl
      #endif

      DisplayValue(trans.uBE[1]*10,-3,'V',3); // Display 3 Digits of this mV units
      wait_about300ms();
    }
  #endif  // WITH_VEXT

  lcd_line2();      // LCD position row 2, column 1
  lcd_fix_string(TestRunning);  // String: testing...

  #ifndef DebugOut
    lcd_line2();    // LCD position row 2, column 1
  #endif

  EntladePins();    // discharge all capacitors!

  if(PartFound == PART_CELL) {
    lcd_clear();
    lcd_fix_string(Cell_str); // display "Cell!"
    goto end2;
  }

  #ifdef CHECK_CALL
    AutoCheck();    // check, if selftest should be done
  #endif
     
  // check all 6 combinations for the 3 pins 
  //       High  Low  Tri
  CheckPins(TP1, TP2, TP3);
  CheckPins(TP2, TP1, TP3);
  CheckPins(TP1, TP3, TP2);
  CheckPins(TP3, TP1, TP2);
  CheckPins(TP2, TP3, TP1);
  CheckPins(TP3, TP2, TP1);
  
  // separate check if is is a capacitor
  if(((PartFound == PART_NONE) || (PartFound == PART_RESISTOR) || (PartFound == PART_DIODE)) ) {
    EntladePins();    // discharge capacities
    // measurement of capacities in all 3 combinations
    cap.cval_max = 0;   // set max to zero
    cap.cpre_max = -12;   // set max to pF unit
    ReadCapacity(TP3, TP1);
    ReadCapacity(TP3, TP2);
    ReadCapacity(TP2, TP1);

    #if FLASHEND > 0x1fff
      ReadInductance();   // measure inductance
    #endif
  }

  // All checks are done, output result to display
  lcd_clear();

  if(PartFound == PART_DIODE) {
    if(NumOfDiodes == 1) {    // single Diode
      //lcd_fix_string(Diode);    // "Diode: "
      intface_t[0] = '0'; // class = diode ??
      #if FLASHEND > 0x1fff
        // enough memory to sort the pins

        #if EBC_STYLE == 321
          // the higher test pin number is left side
          if (diodes[0].Anode > diodes[0].Cathode) {
            lcd_testpin(diodes[0].Anode);
            lcd_fix_string(AnKat);          // "->|-"
            lcd_testpin(diodes[0].Cathode);
            intface_t[3] = 'K'; // Kathode
            intface_t[4] = 'A'; // Anode 
           }else {
            lcd_testpin(diodes[0].Cathode);
            lcd_fix_string(KatAn);          // "-|<-"
            lcd_testpin(diodes[0].Anode);
            intface_t[3] = 'A'; // Anode 
            intface_t[4] = 'K'; // Kathode
          }
        #else
          // the higher test pin number is right side
          if (diodes[0].Anode < diodes[0].Cathode) {
            lcd_testpin(diodes[0].Anode);
            lcd_fix_string(AnKat);          // "->|-"
            lcd_testpin(diodes[0].Cathode);
            intface_t[3] = 'A'; // Anode
            intface_t[4] = 'K'; // Kathode  
          } else {
            lcd_testpin(diodes[0].Cathode);
            lcd_fix_string(KatAn);          // "-|<-"
            lcd_testpin(diodes[0].Anode);
            intface_t[3] = 'K'; // Kathode
            intface_t[4] = 'A'; // Anode  
          }
        #endif

      #else
        // too less memory to sort the pins
        lcd_testpin(diodes[0].Anode);
        lcd_fix_string(AnKat);          // "->|-"
        lcd_testpin(diodes[0].Cathode);
        intface_t[3] = 'A'; // Anode
        intface_t[4] = 'K'; // Kathode  
      #endif
      
      #if FLASHEND > 0x1fff
        GetIr(diodes[0].Cathode,diodes[0].Anode);
      #endif
      if      (intface_t[3] == 'A') kind_nr = 4;
      else if (intface_t[3] == 'K') kind_nr = 8;
      UfOutput(0x70);
      // load current of capacity is (5V-1.1V)/(470000 Ohm) = 8298nA
      lcd_fix_string(GateCap_str);      // "C="
      ReadCapacity(diodes[0].Cathode,diodes[0].Anode);  // Capacity opposite flow direction
      DisplayValue(cap.cval,cap.cpre,'F',3);
      goto end;

    } else if(NumOfDiodes == 2) {   // double diode
      lcd_data('2');
      lcd_fix_string(Diodes);   // "diodes "

      if(diodes[0].Anode == diodes[1].Anode) { //Common Anode
        lcd_testpin(diodes[0].Cathode);
        lcd_fix_string(KatAn);          // "-|<-"
        lcd_testpin(diodes[0].Anode);
        lcd_fix_string(AnKat);          // "->|-"
        lcd_testpin(diodes[1].Cathode);
        UfOutput(0x01);
        goto end;

      } else if(diodes[0].Cathode == diodes[1].Cathode) { //Common Cathode
        lcd_testpin(diodes[0].Anode);
        lcd_fix_string(AnKat);          // "->|-"
        lcd_testpin(diodes[0].Cathode);
        lcd_fix_string(KatAn);          // "-|<-"
        lcd_testpin(diodes[1].Anode);
        UfOutput(0x01);
        goto end;

      } else if ((diodes[0].Cathode == diodes[1].Anode) && (diodes[1].Cathode == diodes[0].Anode)) {
        // Antiparallel
        lcd_testpin(diodes[0].Anode);
        lcd_fix_string(AnKat);          // "->|-"
        lcd_testpin(diodes[0].Cathode);
        lcd_fix_string(AnKat);          // "->|-"
        lcd_testpin(diodes[1].Cathode);
        UfOutput(0x01);
        goto end;
      }

