mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
    } else if(NumOfDiodes == 3) {
      // Serial of 2 Diodes; was detected as 3 Diodes 
      trans.b = 3;
      trans.c = 3;

      // Check for any constallation of 2 serial diodes:
      // Only once the pin No of anyone Cathode is identical of another anode.
      // two diodes in series is additionally detected as third big diode.

      if(diodes[0].Cathode == diodes[1].Anode) {
        trans.b = 0;
        trans.c = 1;
      }
      if(diodes[0].Anode == diodes[1].Cathode) {
        trans.b = 1;
        trans.c = 0;
      }
      if(diodes[0].Cathode == diodes[2].Anode) {
        trans.b = 0;
        trans.c = 2;
      }
      if(diodes[0].Anode == diodes[2].Cathode) {
        trans.b = 2;
        trans.c = 0;
      }
      if(diodes[1].Cathode == diodes[2].Anode) {
        trans.b = 1;
        trans.c = 2;
      }
      if(diodes[1].Anode == diodes[2].Cathode) {
        trans.b = 2;
        trans.c = 1;
      }

      #if DebugOut == 4
        lcd_line3();
        lcd_testpin(diodes[0].Anode);
        lcd_data(':');
        lcd_testpin(diodes[0].Cathode);
        lcd_space();
        lcd_string(utoa(diodes[0].Voltage, outval, 10));
        lcd_space();
        lcd_testpin(diodes[1].Anode);
        lcd_data(':');
        lcd_testpin(diodes[1].Cathode);
        lcd_space();
        lcd_string(utoa(diodes[1].Voltage, outval, 10));
        lcd_line4();
        lcd_testpin(diodes[2].Anode);
        lcd_data(':');
        lcd_testpin(diodes[2].Cathode);
        lcd_space();
        lcd_string(utoa(diodes[2].Voltage, outval, 10));
        lcd_line1();
      #endif

      if((trans.b < 3) && (trans.c < 3)) {
        lcd_data('3');
        lcd_fix_string(Diodes);     // "Diodes "
        lcd_testpin(diodes[trans.b].Anode);
        lcd_fix_string(AnKat);      // "->|-"
        lcd_testpin(diodes[trans.b].Cathode);
        lcd_fix_string(AnKat);      // "->|-"
        lcd_testpin(diodes[trans.c].Cathode);
        UfOutput( (trans.b<<4)|trans.c);
        goto end;
      }
    }
    // end (PartFound == PART_DIODE)

  } else if (PartFound == PART_TRANSISTOR) {
    if(PartReady != 0) {
      if((trans.hfe[0]>trans.hfe[1])) {
        // if the amplification factor was higher at first testr: swap C and E !
        tmp = trans.c;
        trans.c = trans.e;
        trans.e = tmp;
      } else {
        trans.hfe[0] = trans.hfe[1];
        trans.uBE[0] = trans.uBE[1];
      }
    }

    if(PartMode == PART_MODE_NPN) {
      lcd_fix_string(NPN_str);    // "NPN "
      intface_t[0] = '0'; // bipolar
      intface_t[1] = 'N'; // npn
      kind_nr = 1; // npn
    
    } else {
      lcd_fix_string(PNP_str);    // "PNP "
      intface_t[0] = '0'; // bipolar
      intface_t[1] = 'P'; // pnp
      kind_nr = 5; // pnp
     
    }

    if( NumOfDiodes > 2) {  // Transistor with protection diode

      #ifdef EBC_STYLE
        #if EBC_STYLE == 321
          // Layout with 321= style
          if (((PartMode == PART_MODE_NPN) && (trans.c < trans.e)) || ((PartMode != PART_MODE_NPN) && (trans.c > trans.e)))
        #else
          // Layout with EBC= style
          if(PartMode == PART_MODE_NPN)
        #endif
      #else
        // Layout with 123= style
        if (((PartMode == PART_MODE_NPN) && (trans.c > trans.e)) || ((PartMode != PART_MODE_NPN) && (trans.c < trans.e)))
      #endif
        {
          lcd_fix_string(AnKat);  // "->|-"
        } else {
          lcd_fix_string(KatAn);  // "-|<-"
        }
    }

    PinLayout('E','B','C');     // EBC= or 123=...
    lcd_line2();                        // 2 row 
    lcd_fix_string(hfe_str);    // "B="  (hFE)     // ##################################################################################################################
    DisplayValue(trans.hfe[0],0,0,3);
    lcd_space();

    lcd_fix_string(Uf_str);   // "Uf="
    DisplayValue(trans.uBE[0],-3,'V',3);
    goto end;

    // end (PartFound == PART_TRANSISTOR)

  } else if (PartFound == PART_FET) { // JFET or MOSFET

    if(PartMode&1) {
      lcd_data('P'); // P-channel
      intface_t[1] = 'P'; // P-channel
      kind_nr = 6;  // preset as P_Mos
     
    } else {
      lcd_data('N'); // N-channel
      intface_t[1] = 'N'; // N-channel
      kind_nr = 2;  // preset as N_Mos
     
    }
    lcd_data('-');

    tmp = PartMode/2;
    if (tmp == (PART_MODE_N_D_MOS/2)) {
      lcd_data('D'); // N-D
      intface_t[2] = 'D'; // Depletion
      kind_nr = 9; // handle depletion-Mosfet like JFET #########
     
    }
    if (tmp == (PART_MODE_N_E_MOS/2)) {
      lcd_data('E'); // N-E
      intface_t[2] = 'E'; // Enhancement
    }

    if (tmp == (PART_MODE_N_JFET/2)) {
      lcd_fix_string(jfet_str);         // "JFET"
      intface_t[0] = '2';    // class: JFET
      kind_nr = kind_nr + 1; // change from preset Mosfet to JFET
      
     
    } else {
      lcd_fix_string(mosfet_str);       // "-MOS "
      intface_t[0] = '1';  // class: MOSFET
    }

    PinLayout('S','G','D');     // SGD= or 123=...

    if((NumOfDiodes > 0) && (PartMode < PART_MODE_N_D_MOS)) {
      // MOSFET with protection diode; only with enhancement-FETs

      #ifdef EBC_STYLE
        #if EBC_STYLE == 321
          // layout with 321= style
          if (((PartMode&1) && (trans.c > trans.e)) || ((!(PartMode&1)) && (trans.c < trans.e)))
        #else
          // Layout with SGD= style
          if (PartMode&1)   // N or P MOS
        #endif
      #else
        // layout with 123= style
        if (((PartMode&1) && (trans.c < trans.e)) || ((!(PartMode&1)) && (trans.c > trans.e)))
      #endif
        {
          lcd_data(LCD_CHAR_DIODE1);  // show Diode symbol >|
        } else {
          lcd_data(LCD_CHAR_DIODE2);  // show Diode symbol |<
        }
    }

    lcd_line2();  // 2 row

    if(PartMode < PART_MODE_N_D_MOS) {    // enhancement-MOSFET
      // Gate capacity
      lcd_fix_string(GateCap_str);    // "C="
      ReadCapacity(trans.b,trans.e);    // measure capacity
      DisplayValue(cap.cval,cap.cpre,'F',3);
      lcd_fix_string(vt_str);     // "Vt="
    } else {
      lcd_data('I');
      lcd_data('=');
      DisplayValue(trans.uBE[1],-5,'A',2);
  //    Serial.println(trans.uBE[1]);  //#########
      if (trans.uBE[1] > 550) s_vgs = 1; // > 4V
      lcd_fix_string(Vgs_str);      // " Vgs="
    }

    // Gate-threshold voltage
    DisplayValue(gthvoltage,-3,'V',2);
    goto end;

