mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
    // end (PartFound == PART_FET)

  } else if (PartFound == PART_THYRISTOR) {
    lcd_fix_string(Thyristor);      // "Thyristor"
    goto gakOutput;

  } else if (PartFound == PART_TRIAC) {
    lcd_fix_string(Triac);      // "Triac"
    goto gakOutput;

  } else if(PartFound == PART_RESISTOR) {
    if (ResistorsFound == 1) {      // single resistor
      lcd_testpin(resis[0].rb);     // Pin-number 1
      lcd_fix_string(Resistor_str);
      lcd_testpin(resis[0].ra);     // Pin-number 2
    } else {          // R-Max suchen
      ii = 0;
      if (resis[1].rx > resis[0].rx)
        ii = 1;

      if (ResistorsFound == 2) {
        ii = 2;
      } else {
        if (resis[2].rx > resis[ii].rx)
          ii = 2;
      }

      char x = '1';
      char y = '3';
      char z = '2';
   
      if (ii == 1) {
        //x = '1';
        y = '2';
        z = '3';
      }

      if (ii == 2) {
        x = '2';
        y = '1';
        z = '3';
      }

      lcd_data(x);
      lcd_fix_string(Resistor_str);    // "-[=]-"
      lcd_data(y);
      lcd_fix_string(Resistor_str);    // "-[=]-"
      lcd_data(z);
    }

    lcd_line2();  // 2 row 

    if (ResistorsFound == 1) {
      RvalOut(0);

      #if FLASHEND > 0x1fff
        if (resis[0].lx != 0) {
          // resistor have also Inductance
          lcd_fix_string(Lis_str);        // "L="
          DisplayValue(resis[0].lx,resis[0].lpre,'H',3);  // output inductance
        }
      #endif

    } else {
      // output resistor values in right order
      if (ii == 0) {
        RvalOut(1);
        RvalOut(2);
      }
      if (ii == 1) {
        RvalOut(0);
        RvalOut(2);
      }
      if (ii == 2) {
        RvalOut(0);
        RvalOut(1);
      }
    }
    goto end;

    // end (PartFound == PART_RESISTOR)

  // capacity measurement is wanted
  } else if(PartFound == PART_CAPACITOR) {
    //lcd_fix_string(Capacitor);
    lcd_testpin(cap.ca);    // Pin number 1
    lcd_fix_string(CapZeich);   // capacitor sign
    lcd_testpin(cap.cb);    // Pin number 2

    #if FLASHEND > 0x1fff
      GetVloss();     // get Voltage loss of capacitor
      if (cap.v_loss != 0) {
        lcd_fix_string(VLOSS_str);  // "  Vloss="
        DisplayValue(cap.v_loss,-1,'%',2);
      }
    #endif

    lcd_line2();  // 2 row 
    DisplayValue(cap.cval_max,cap.cpre_max,'F',4);

    #if FLASHEND > 0x1fff
      cap.esr = GetESR(cap.cb, cap.ca);   // get ESR of capacitor
      if (cap.esr < 65530) {
        lcd_fix_string(ESR_str);
        DisplayValue(cap.esr,-2,LCD_CHAR_OMEGA,2);
      }
    #endif

    goto end;
  }

  if(NumOfDiodes == 0) {    // no diodes are found
    lcd_fix_string(TestFailed1);  // "No, unknown, or"
    lcd_line2();      // 2 row 
    lcd_fix_string(TestFailed2);  // "damaged "
    lcd_fix_string(Component);    // "part"
  } else {
    lcd_fix_string(Component);    // "part"
    lcd_fix_string(Unknown);    // " unknown"
    lcd_line2();      // 2 row 
    lcd_fix_string(OrBroken);     // "or damaged "
    lcd_data(NumOfDiodes + '0');
    lcd_fix_string(AnKat);    // "->|-"
  }

  empty_count++;
  mess_count = 0;
  goto end2;

gakOutput:
  lcd_line2();  // 2 row 
  PinLayout(Cathode_char,'G','A');  // CGA= or 123=...

//- - - - - - - - - - - - - - - - - - - - - - - - - - - -
end:
  empty_count = 0;    // reset counter, if part is found
  mess_count++;      // count measurements

end2:
 
 // lcd.clear();     // clear total line test  CT CT <ct test ########################################################
 // lcd_line1();      // Cursor to column 1, row 1
 // lcd_line2();  // 2 row 

 // for (int8_t ilx=0;ilx<6;ilx++) {
 //    lcd_data(intface_t[ilx]);    //ct test ####################################
 // }
  //   CT CT
  /*  test
  lcd_line2();      // Cursor to column 1, row 1
  lcd_string("Cl ");
  lcd.write(intface_t[0]);//CurDUTclass+48);  // class // 1=Diode,2=npn/pnp,3=Mosfet,4=j-Fet
  lcd_string(" kind ");
  lcd.write(curkind+48);      // ascII
  lcd.write(' ');
  lcd.write(intface_t[3]);8z
  lcd.write(intface_t[4]);
  lcd.write(intface_t[5]);
  */
  if (intface_t[3] == 'A' and intface_t[4] == 'K'){
    kind_nr = 8;  // P-Diode
   
  }
  if (intface_t[4] == 'A' and intface_t[3] == 'K'){
    kind_nr = 4;  // N-Diode
  
  }

  uart_putc(' ');
  uart_putc(intface_t[0]);
  uart_putc(intface_t[1]);
  uart_putc(intface_t[2]);
  uart_putc(intface_t[3]);
  uart_putc(intface_t[4]);
  uart_putc(intface_t[5]);
  uart_putc(intface_t[6]);
  if (s_auto ==1) uart_putx(kind_nr+65);    // int(0...9) to ascii  'A','B',...'J' ########################
  else uart_putx(kind_nr+48);    // int(0...9) to ascii '0'...'9' ##########################################
  uart_putx('\n');
/*  
// set 4-bit-dac  ############################################
   if      (kind_nr == 1) {  // npn
    mcp.setPinX(4,B,OUTPUT,HIGH);
  }
  else if (kind_nr == 2) {  // n-Mosfet
    mcp.setPinX(5,B,OUTPUT,HIGH);
  }
 
  else if (kind_nr == 3) {  // n-jFet
    if (intface_t[2] == 'D') {  // depletion-Mosfet
      mcp.setPinX(4,B,OUTPUT,HIGH);
      mcp.setPinX(5,B,OUTPUT,HIGH);
     
    }
    else mcp.setPinX(6,B,OUTPUT,HIGH);
  }
  else if (kind_nr == 4) {  // n-Diode
    mcp.setPinX(5,B,OUTPUT,HIGH);
    mcp.setPinX(6,B,OUTPUT,HIGH);
  }
  else if (kind_nr == 5) {  // pnp
    mcp.setPinX(7,B,OUTPUT,HIGH);
  }
  else if (kind_nr == 6) {  // p-Mosfet
    mcp.setPinX(5,B,OUTPUT,HIGH);
    mcp.setPinX(7,B,OUTPUT,HIGH);
  }
  else if (kind_nr == 7) {  // n-jFet
    mcp.setPinX(6,B,OUTPUT,HIGH);
    mcp.setPinX(7,B,OUTPUT,HIGH);
  }
  else if (kind_nr == 8) {  // p-Diode
    mcp.setPinX(5,B,OUTPUT,HIGH);
    mcp.setPinX(6,B,OUTPUT,HIGH);
    mcp.setPinX(7,B,OUTPUT,HIGH);
  }
  */
  if (kind_nr == 1 or kind_nr == 5) intface_t[0] = '0';  // bipolar
  ///  ###test###################################################################
  
  /* intface_t[0] = '2';
   intface_t[1] = 'N';
   intface_t[2] = ' ';
   intface_t[3] = 'B';
   intface_t[4] = 'C';
   intface_t[5] = 'E';
   Serial.print(" nach end: "); Serial.println(intface_t[0]);*/
  // if (intface_t[0] >= '0' and intface_t[0] <= '2')  // class: 0=bipolar,1=Mosfet,2=jFet 
 //  Serial.print(" kind_nr "); Serial.print(kind_nr);Serial.print(" intface_t[0] "); Serial.println(intface_t[0]);
  
