mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
 /*
  s_switch = 0;
  int ict = 0;
  while (s_switch == 0) {
    uart_putx(kind_nr+48);    // int(0...9) to ascii
    uart_putx('\n');
    delay(1);
    ict++;
    if (ict > 100) break;
  }  
  */
  delay(2000);  //####################################################
  if (kind_nr > 0) return; // curve-tracer  <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<CT CT CT CT #############################################
  delay(200);
  //ADC_DDR = (1<<TPREF) | TXD_MSK;  // switch pin with reference to GND, release relay
  ADC_DDR = TXD_MSK;                 // switch pin with reference to GND, release relay
  goto start;

  while(!(ON_PIN_REG & (1<<RST_PIN)));  // wait ,until button is released
  wait_about200ms();
  // wait 14 seconds or 5 seconds (if repeat function)

  for(gthvoltage = 0;gthvoltage<display_time;gthvoltage+=10) {
    if(!(ON_PIN_REG & (1<<RST_PIN))) {
      // If the key is pressed again... 
      // goto start of measurement 
      goto start;
    }
    wdt_reset();
    wait_about10ms();
  }

  #ifdef POWER_OFF
    #if POWER_OFF > 127
      #define POWER2_OFF 255
    #else
      #define POWER2_OFF POWER_OFF*2
    #endif

    #if POWER_OFF+0 > 1
      if ((empty_count < POWER_OFF) && (mess_count < POWER2_OFF)) {
        goto start;     // repeat measurement POWER_OFF times
      }
    #endif

    // only one Measurement requested, shut off
    //MCUSR = 0;
   // ON_PORT &= ~(1<<ON_PIN);    // switch off power
    // never ending loop 
    while(1) {
      if(!(ON_PIN_REG & (1<<RST_PIN))) {
        // The statement is only reached if no auto off equipment is installed
        goto start;
      }
      wdt_reset();
      wait_about10ms();
    }

  #else
    //CT
   
    goto start;  // POWER_OFF not selected, repeat measurement
  #endif

  return;
 
} // end Tran_Test







void switchMatrix(uint8_t kind_nr,char pin1,char pin2,char pin3)  {// {0=tkNothing,1=tkNPN,2=tkNMOSFET,3=tkNJFET,4=tkNDiode,5=tkPNP,6=tkPMOSFET,7=tkPJFET,8=tkPDiode};
    sw1 = 0;
    sw2 = 0;
    sw3 = 0;
    
    pinMode(2,INPUT);   
    pinMode(3,INPUT);
    pinMode(4,INPUT);
    pinMode(5,INPUT);
    pinMode(6,INPUT);  
    pinMode(7,INPUT);    
    pinMode(9,INPUT);    
    pinMode(11,INPUT); 
    pinMode(13,INPUT);    
    if (kind_nr == 4 or kind_nr == 8)   { // diode
      if (pin1 == 'K' ) {  // "n-Diode"
        pin1 = 'E';
        pin2 = 'B';  // ??
        pin3 = 'C';     
      }
      else {               // "p-Diode"
        pin1 = 'C';
        pin2 = 'B'; // ??
        pin3 = 'E';
      }
    }
    if (kind_nr == 2 or kind_nr == 3 or kind_nr == 6 or kind_nr == 7 or kind_nr == 9) {  // change Fet-Pins G,D,S to bipolar-Pins B,C,E 
      if (s_vgs == 1) {
        char tp[4];
        if      (pin1 == 'S' and pin2 == 'D') {
          pin1 = 'D';
          pin2 = 'S'; 
        }
        else if (pin1 == 'S' and pin3 == 'D') {
          pin1 = 'D';
          pin3 = 'S'; 
        }
        else if (pin2 == 'S' and pin3 == 'D') {
          pin2 = 'D';
          pin3 = 'S'; 
        }
        else if (pin2 == 'S' and pin1 == 'D') {
          pin2 = 'D';
          pin1 = 'S'; 
        }
        else if (pin3 == 'S' and pin1 == 'D') {
          pin3 = 'D';
          pin1 = 'S'; 
        }
        else if (pin3 == 'S' and pin2 == 'D') {
          pin3 = 'D';
          pin2 = 'S'; 
        }
    //    Serial.print("s-vgs pin1 ");Serial.print(pin1);Serial.print(" pin2 ");Serial.print(pin2);Serial.print(" pin3 ");Serial.println(pin3);
        s_vgs = 0;
      }
      if      (pin1 == 'G') {  
        pin1 = 'B';
        if (pin2 == 'D') {
          pin2 = 'C';
          pin3 = 'E'; 
        }
        else {
          pin2 = 'E';
          pin3 = 'C'; 
        }
      }
      else if (pin1 == 'D') {
        pin1 = 'C';
        if (pin2 == 'G') {
          pin2 = 'B';
          pin3 = 'E'; 
        }
        else {             // pin2 = 'S'
          pin2 = 'E';
          pin3 = 'B'; 
        }
      }
      else if (pin1 == 'S') {
        pin1 = 'E';
        if (pin2 == 'G') {
          pin2 = 'B';
          pin3 = 'C'; 
        }
        else {            // pin2 = 'D'
          pin2 = 'C';
          pin3 = 'B'; 
        }
      }
    
    }
    if (pin1 == 'E' and pin2 == 'B' and pin3 == 'C') {  // EBC SGD 159 -> 2613
      
      sw1 = 1;
      sw2 = 5;
      sw3 = 9;                                                        
      return;
    }
    if (pin1 == 'E' and pin2 == 'C' and pin3 == 'B') {  // ECB SDG 168 -> 2711
      sw1 = 1;
      sw2 = 6;
      sw3 = 8;
      return;
    }
    if (pin1 == 'B' and pin2 == 'C' and pin3 == 'E') {  // BCE GDS 267 -> 379
      sw1 = 2;
      sw2 = 6;
      sw3 = 7;
      return;
    } 
    if (pin1 == 'B' and pin2 == 'E' and pin3 == 'C') {  // BEC GSD 249 -> 3513
      sw1 = 2;
      sw2 = 4;
      sw3 = 9;
      return;
    }   
    if (pin1 == 'C' and pin2 == 'B' and pin3 == 'E') {  // CBE DGS 357 -> 469
      sw1 = 3;
      sw2 = 5;
      sw3 = 7;
      return;
    }   
    if (pin1 == 'C' and pin2 == 'E' and pin3 == 'B') {  // CEB DSG 348 -> 4511
      sw1 = 3;
      sw2 = 4;
      sw3 = 8;
      return;
    }   
}

void setOutput(int pin_H) {  
  pinMode(pin_H,OUTPUT);
  digitalWrite(pin_H,HIGH);
 // Serial.println(pin_H);
 
}  

void disconnectPins_EBC() {
   digitalWrite(pin_ADC_SW,LOW);// disconnect ADC0,1,2 from TP1,2,3
   pinMode(14,INPUT);  // disconnect ADC0,1,2 from TP1,2,3
   pinMode(15,INPUT);  
   pinMode(16,INPUT);  
   delay(5);
 
  
   if      (sw1 >= 1 and sw1 <= 6) setOutput(sw1+1);    // D2...D7
   else if (sw1 == 7) setOutput(9);     // D9   // A?
   else if (sw1 == 8) setOutput(11);    // D11  // B?
   else if (sw1 == 9) setOutput(13);    // D13  // C?

  
   
   if      (sw2 >= 1 and sw2 <= 6) setOutput(sw2+1);    // D2...D7
   else if (sw2 == 7) setOutput(9);     // D9  // A?
   else if (sw2 == 8) setOutput(11);    // D11 // B?
   else if (sw2 == 9) setOutput(13);    // D13 // C?

  
