mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
  tabind = referenz / Ref_Tab_Abstand;
  tabres = referenz % Ref_Tab_Abstand;
  tabres = Ref_Tab_Abstand-tabres;

  if (tabind > 7) {
    tabind = 7;   // limit to end of table
  }

  // interpolate the table of factors
  y1 = pgm_read_word(&RHtab[tabind]);
  y2 = pgm_read_word(&RHtab[tabind+1]);
  // RHmultip is the interpolated factor to compute capacity from load time with 470k
  RHmultip = ((y1 - y2) * tabres + (Ref_Tab_Abstand/2)) / Ref_Tab_Abstand + y2;
}
#endif

#ifdef LCD_CLEAR
void lcd_clear_line(void) {
  // writes 20 spaces to LCD-Display, Cursor must be positioned to first column
  unsigned char ll;
  for (ll=0;ll<20;ll++) {
    lcd_space();
  }
}
#endif


/* ************************************************************************
 *   display of values and units
 * ************************************************************************ */
/*
 *  display value and unit
 *  - max. 4 digits excluding "." and unit
 *
 *  requires:
 *  - value
 *  - exponent of factor related to base unit (value * 10^x)
 *    e.g: p = 10^-12 -> -12
 *  - unit character (0 = none)
 *  digits = 2, 3 or 4
 */
void DisplayValue(unsigned long Value, int8_t Exponent, unsigned char Unit, unsigned char digits)
{
  char OutBuffer[15];
  unsigned int      Limit;
  unsigned char     Prefix;   // prefix character
  uint8_t           Offset;   // exponent of offset to next 10^3 step
  uint8_t           Index;    // index ID
  uint8_t           Length;   // string length

  Limit = 100;        // scale value down to 2 digits
  if (digits == 3) Limit = 1000;  // scale value down to 3 digits
  if (digits == 4) Limit = 10000; // scale value down to 4 digits

  while (Value >= Limit)
  {
    Value += 5;       // for automatic rounding
    Value = Value / 10;     // scale down by 10^1
    Exponent++;       // increase exponent by 1
  }

  // determine prefix

  Length = Exponent + 12;
  if ((int8_t)Length <  0) Length = 0;  // Limit to minimum prefix
  if (Length > 18) Length = 18;   // Limit to maximum prefix
  Index = Length / 3;
  Offset = Length % 3;

  if (Offset > 0)
    {
      Index++;        // adjust index for exponent offset, take next prefix
      Offset = 3 - Offset;    // reverse value (1 or 2)
    }

  #ifdef NO_NANO
    if (Index == 1)
      { // use no nano
        Index++;      // use mikro instead of nano
        Offset += 3;      // can be 3,4 or 5
      }
  #endif

  Prefix = MEM_read_byte((uint8_t *)(&PrefixTab[Index]));   // look up prefix in table

  // display value

  // convert value into string
  utoa((unsigned int)Value, OutBuffer, 10);
  Length = strlen(OutBuffer);

  // position of dot
  Exponent = Length - Offset;   // calculate position

  if (Exponent <= 0)      // we have to prepend "0."
  {
    // 0: factor 10 / -1: factor 100
    //lcd_data('0');
    lcd_data('.');

    #ifdef NO_NANO
      while (Exponent < 0)
        {
          lcd_data('0');    // extra 0 for factor 10
          Exponent++;
        }
    #else
      if (Exponent < 0) lcd_data('0');  // extra 0 for factor 100
    #endif
  }

  if (Offset == 0) Exponent = -1; // disable dot if not needed

  // adjust position to array or disable dot if set to 0
  //Exponent--;

  // display value and add dot if requested
  Index = 0;
  while (Index < Length)    // loop through string
  {
    lcd_data(OutBuffer[Index]);   // display char
    Index++;        // next one
    if (Index == Exponent) {
      lcd_data('.');      // display dot
    }
  }

  // display prefix and unit
  if (Prefix != 0) lcd_data(Prefix);
  if (Unit) lcd_data(Unit);
}


#ifndef INHIBIT_SLEEP_MODE
// set the processor to sleep state
// wake up will be done with compare match interrupt of counter 2
void sleep_5ms(uint16_t pause){
  // pause is the delay in 5ms units
  uint8_t t2_offset;

  #define RESTART_DELAY_US (RESTART_DELAY_TICS/(F_CPU/1000000UL))
  // for 8 MHz crystal the Restart delay is 16384/8 = 2048us

  while (pause > 0) {

    #if 3000 > RESTART_DELAY_US
      if (pause > 1) {
        // Startup time is too long with 1MHz Clock!!!!
        t2_offset = (10000 - RESTART_DELAY_US) / T2_PERIOD; // set to 10ms above the actual counter
        pause -= 2;
      } else {
        t2_offset = (5000 - RESTART_DELAY_US) / T2_PERIOD;  // set to 5ms above the actual counter
        pause = 0;
      }

      OCR2A = TCNT2 + t2_offset;      // set the compare value
      TIMSK2 = (0<<OCIE2B) | (1<<OCIE2A) | (0<<TOIE2);  // enable output compare match A interrupt

      set_sleep_mode(SLEEP_MODE_PWR_SAVE);
      //set_sleep_mode(SLEEP_MODE_IDLE);
      sleep_mode();
      // wake up after output compare match interrupt
    #else
      // restart delay ist too long, use normal delay of 5ms
      wait5ms();
    #endif

    wdt_reset();
  }

  TIMSK2 = (0<<OCIE2B) | (0<<OCIE2A) | (0<<TOIE2);  // disable output compare match A interrupt
}
#endif


// show the Pin Layout of the device 
void PinLayout(char pin1, char pin2, char pin3) {
  // pin1-3 is EBC or SGD or CGA
  #ifndef EBC_STYLE
    // Layout with 123= style
    lcd_fix_string(N123_str);     // " 123="
    for (ii=0;ii<3;ii++) {  // Output Character in right order
      if (ii == trans.e) {
        lcd_data(pin1); 
        intface_t[3+ii] = pin1;
      }
      if (ii == trans.b) {
        lcd_data(pin2);
        intface_t[3+ii] = pin2;
      }
      if (ii == trans.c) {
        lcd_data(pin3);
        intface_t[3+ii] = pin3;
      }
    }
  #else
    #if EBC_STYLE == 321
      // Layout with 321= style
      lcd_fix_string(N321_str);     // " 321="
      ii = 3;
      while (ii != 0) { // Output Character in right order
        ii--;
        if (ii == trans.e) {
          lcd_data(pin1); 
          intface_t[3+ii] = pin1;
        }
        if (ii == trans.b) {
          lcd_data(pin2);
          intface_t[3+ii] = pin2;
        }
        if (ii == trans.c) {
          lcd_data(pin3);
          intface_t[3+ii] = pin3;
        }  
      }
    #else 
      // Layout with EBC= style
      lcd_space();
      lcd_data(pin1);
      lcd_data(pin2);
      lcd_data(pin3);
      intface_t[3] = pin1;
      intface_t[4] = pin2;
      intface_t[5] = pin3;
      lcd_data('=');
      lcd_testpin(trans.e);
      lcd_testpin(trans.b);
      lcd_testpin(trans.c);
    #endif
  #endif
}

/* -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- */

void AutoCheck(void) {
#ifdef WITH_SELFTEST

  uint8_t tt;   // number of running test
  uint8_t ww;   // counter for repeating the tests
  int  adcmv[7];
  uint16_t u680;  // 3 * (Voltage at 680 Ohm)

  // define the maximum count of repetitions MAX_REP
  #define MAX_REP 4

  #ifdef AUTO_CAL
    uint8_t cap_found;  // counter for found capacitor

    #ifdef AUTOSCALE_ADC
      int8_t udiff;   // difference between ADC Voltage with VCC or Bandgap reference
      int8_t udiff2;
    #endif
  #endif

  ADC_PORT = TXD_VAL;
  ADC_DDR = TXD_MSK;

