mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
  #define RequireShortedProbes

  if (AllProbesShorted() != 3) return;

  lcd_clear();
  lcd_fix_string(SELFTEST);   // "Selftest mode.."

  lcd_line2();
  lcd_fix2_string(R0_str);    // "R0="

  eeprom_write_byte((uint8_t *)(&EE_ESR_ZEROtab[2]), (int8_t)0);  // clear zero offset
  eeprom_write_byte((uint8_t *)(&EE_ESR_ZEROtab[3]), (int8_t)0);  // clear zero offset
  eeprom_write_byte((uint8_t *)(&EE_ESR_ZEROtab[1]), (int8_t)0);  // clear zero offset

  adcmv[0] = GetESR(TP3, TP1);
  adcmv[1] = GetESR(TP3, TP2);
  adcmv[2] = GetESR(TP2, TP1);

  DisplayValue(adcmv[0],-2,' ',3);
  DisplayValue(adcmv[1],-2,' ',3);
  DisplayValue(adcmv[2],-2,LCD_CHAR_OMEGA,3);

  if (adcmv[0] < 60) {
    eeprom_write_byte((uint8_t *)(&EE_ESR_ZEROtab[2]), (int8_t)adcmv[0]); // fix zero offset
  }
  if (adcmv[1] < 60) {
    eeprom_write_byte((uint8_t *)(&EE_ESR_ZEROtab[3]), (int8_t)adcmv[1]); // fix zero offset
  }
  if (adcmv[2] < 60) {
    eeprom_write_byte((uint8_t *)(&EE_ESR_ZEROtab[1]), (int8_t)adcmv[2]); // fix zero offset
  }

  for(tt=0; tt<12; tt++) {
    wait_about500ms();

    if(!(ON_PIN_REG & (1<<RST_PIN))) {
      // if key is pressed, don't repeat
      break;
    }
  }   // end for tt

  #define TEST_COUNT 8
 
  for(tt=1; tt<TEST_COUNT; tt++) {  // loop for all Tests
    for(ww=0; ww<MAX_REP; ww++) { // repeat the test MAX_REP times
      lcd_line2();      // Cursor to column 1, row 2
      lcd_clear_line();     // clear total line
      lcd_line1();      // Cursor to column 1, row 1
      lcd_clear_line();     // clear total line
      lcd_line1();      // Cursor to column 1, row 1
      lcd_data('T');      // output the Testmode "T"
      lcd_string(utoa(tt, outval, 10)); // output Test number
      lcd_space();

      if (tt == 1) {    // output of reference voltage and factors for capacity measurement
        Calibrate_UR();   // get Reference voltage, Pin resistance
        lcd_fix2_string(URefT); // "URef="
        DisplayValue(ref_mv,-3,'V',4);
        lcd_line2();        // Cursor to column 1, row 2
        lcd_fix2_string(RHfakt);    // "RHf="
        lcd_string(utoa(RHmultip, outval, 10));
        ADCconfig.Samples = 190;    // set number of ADC reads near to maximum
      }

      if (tt == 2) {  // how equal are the RL resistors? 
        u680 = ((long)ADCconfig.U_AVCC * (PIN_RM + R_L_VAL) / (PIN_RM + R_L_VAL + R_L_VAL + PIN_RP));
        R_PORT = 1<<(TP1*2);      // RL1 to VCC
        R_DDR = (1<<(TP1*2)) | (1<<(TP2*2));  // RL2 to -
        adcmv[0] = W20msReadADC(TP1);
        adcmv[0] -= u680;
        R_DDR = (1<<(TP1*2)) | (1<<(TP3*2));  // RL3 to -
        adcmv[1] = W20msReadADC(TP1);
        adcmv[1] -= u680;
        R_PORT = 1<<(TP2*2);      // RL2 to VCC
        R_DDR = (1<<(TP2*2)) | (1<<(TP3*2));  // RL3 to -
        adcmv[2] = W20msReadADC(TP2);
        adcmv[2] -= u680;
        lcd_fix_string(RLRL);     // "RLRL"
      }

      if (tt == 3) {  // how equal are the RH resistors
        R_PORT = 2<<(TP1*2);      // RH1 to VCC
        R_DDR = (2<<(TP1*2)) | (2<<(TP2*2));  // RH2 to -
        adcmv[0] = W20msReadADC(TP1);
        adcmv[3] = ADCconfig.U_AVCC / 2;
        adcmv[0] -= adcmv[3];
        R_DDR = (2<<(TP1*2)) | (2<<(TP3*2));  // RH3 to -
        adcmv[1] = W20msReadADC(TP1);
        adcmv[1] -= adcmv[3];
        R_PORT = 2<<(TP2*2);      // RH2 to VCC
        R_DDR = (2<<(TP2*2)) | (2<<(TP3*2));  // RH3 to -
        adcmv[2] = W20msReadADC(TP2);
        adcmv[2] -= adcmv[3];
        lcd_fix_string(RHRH);     // "RHRH"
      }

      if (tt == 4) {  // Text release probes
        lcd_fix_string(RELPROBE);   // "Release Probes"
        if (AllProbesShorted() != 0) ww = MAX_REP-2;
      }

      if (tt == 5) {  // can we switch the ADC pins to GND across R_H resistor?
        R_PORT = 0;
        R_DDR = 2<<(TP1*2);   // Pin 1 over R_H to GND
        adcmv[0] = W20msReadADC(TP1);

        R_DDR = 2<<(TP2*2);   // Pin 2 over R_H to GND
        adcmv[1] = W20msReadADC(TP2);

        R_DDR = 2<<(TP3*2);   // Pin 3 over R_H to GND
        adcmv[2] = W20msReadADC(TP3);
        lcd_fix_string(RH1L);   // "RH_Lo="
      }

      if (tt == 6) {  // can we switch the ADC pins to VCC across the R_H resistor?
        R_DDR = 2<<(TP1*2);   // Pin 1 over R_H to VCC
        R_PORT = 2<<(TP1*2);
        adcmv[0] = W20msReadADC(TP1) - ADCconfig.U_AVCC;
        R_DDR = 2<<(TP2*2);   // Pin 2 over R_H to VCC
        R_PORT = 2<<(TP2*2);
        adcmv[1] = W20msReadADC(TP2) - ADCconfig.U_AVCC;
        R_DDR = 2<<(TP3*2);   // Pin 3 over R_H to VCC
        R_PORT = 2<<(TP3*2);
        adcmv[2] = W20msReadADC(TP3) - ADCconfig.U_AVCC;
        lcd_fix_string(RH1H);   // "RH_Hi="
      }

      if (tt == 7) {  // can we switch the ADC pins to VCC across the R_H resistor?
        u680 = ((long)ADCconfig.U_AVCC * (PIN_RM + R_L_VAL) / (PIN_RM + R_L_VAL + R_H_VAL*100));
        R_PORT = 2<<(TP1*2);      // RH1 to VCC
        R_DDR = (2<<(TP1*2)) | (1<<(TP1*2));  // RH1 to +, RL1 to -
        adcmv[0] = W20msReadADC(TP1);
        adcmv[0] -= u680;
        R_PORT = 2<<(TP2*2);      // RH2 to VCC
        R_DDR = (2<<(TP2*2)) | (1<<(TP2*2));  // RH2 to +, RL2 to -
        adcmv[1] = W20msReadADC(TP2);
        adcmv[1] -= u680;
        R_PORT = 2<<(TP3*2);      // RH3 to VCC
        R_DDR = (2<<(TP3*2)) | (1<<(TP3*2));  // RH3 to +, RL3 to -
        adcmv[2] = W20msReadADC(TP3);
        adcmv[2] -= u680;
        lcd_fix_string(RHRL);     // "RH/RL"
      }

      if (tt > 1) { // output 3 voltages 
        lcd_line2();        // Cursor to column 1, row 2
        lcd_string(itoa(adcmv[0], outval, 10)); // output voltage 1
        lcd_space();
        lcd_string(itoa(adcmv[1], outval, 10)); // output voltage 2
        lcd_space();
        lcd_string(itoa(adcmv[2], outval, 10)); // output voltage 3
      }

        ADC_DDR =  TXD_MSK;   // all-Pins to Input
        ADC_PORT = TXD_VAL;   // all ADC-Ports to GND
        R_DDR = 0;      // all R-Ports to Input
        R_PORT = 0;

      if(!(ON_PIN_REG & (1<<RST_PIN))) {
        // if key is pressed, don't repeat
        break;
      }
      wait_about500ms();

      if(!(ON_PIN_REG & (1<<RST_PIN))) {
        // if key is pressed, don't repeat
        break;
      }
      wait_about500ms();

