mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
  PartFound = PART_NONE;
  wait_about1s();
#endif
} 

 
#ifdef RequireShortedProbes
/*
 *  check for a short circuit between two probes
 *  from Markus R.
 *
 *  requires:
 *  - ID of first probe (0-2)
 *  - ID of second probe (0-2)
 *
 *  returns:
 *  - 0 if not shorted
 *  - 1 if shorted
 */

uint8_t ShortedProbes(uint8_t Probe1, uint8_t Probe2)
{
  uint8_t           Flag1 = 0;  // return value
  unsigned int      U1;   // voltage at probe #1 in mV
  unsigned int      U2;   // voltage at probe #2 in mV
  unsigned int      URH;  // half of reference voltage

  // Set up a voltage divider between the two probes:
  // - Probe1: Rl pull-up
  // - Probe2: Rl pull-down

  R_PORT = pgm_read_byte(&PinRLtab[Probe1]);
  R_DDR = pgm_read_byte(&PinRLtab[Probe1]) | pgm_read_byte(&PinRLtab[Probe2]);

  // read voltages
  U1 = ReadADC(Probe1);
  U2 = ReadADC(Probe2);

  // We expect both probe voltages to be about the same and
  // to be half of Vcc (allowed difference +/- 20mV).

  URH = ADCconfig.U_AVCC / 2;
  if ((U1 > URH - 20) && (U1 < URH + 20))
  {
    if ((U2 > URH - 20) && (U2 < URH + 20))
    {
      Flag1 = 1;
    }
  }

  // reset port
  R_DDR = 0;

  return Flag1;
}

/*
 *  check for a short circuit between all probes
 *  from Markus R.
 *
 *  returns:
 *  - 0 if no probes are short-circuited
 *  - number of probe pairs short-circuited (3 = all)
 */

uint8_t AllProbesShorted(void)
{
  uint8_t Flag2;      // return value

  // check all possible combinations
  Flag2 = ShortedProbes(TP1, TP2);
  Flag2 += ShortedProbes(TP1, TP3);
  Flag2 += ShortedProbes(TP2, TP3);

  return Flag2;
}
#endif

/* -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- */

//******************************************************************
void CheckPins(uint8_t HighPin, uint8_t LowPin, uint8_t TristatePin) {
  /*
  Function for checking the characteristic of a component with the following pin assignment 
  parameters:
  HighPin: Pin, which will be switched to VCC at the beginning
  LowPin: Pin, which will be switch to GND at the beginning
  TristatePin: Pin, which will be undefined at the beginning
  TristatePin will be switched to GND and VCC also .
  */
  struct {
    unsigned int lp_otr;
    unsigned int hp1;
    unsigned int hp2;
    unsigned int hp3;
    unsigned int lp1;
    unsigned int lp2;
    unsigned int tp1;
    unsigned int tp2;
  } adc;
  uint8_t LoPinRL;    // mask to switch the LowPin with R_L
  uint8_t LoPinRH;    // mask to switch the LowPin with R_H
  uint8_t TriPinRL;   // mask to switch the TristatePin with R_L
  uint8_t TriPinRH;   // mask to switch the TristatePin with R_H
  uint8_t HiPinRL;    // mask to switch the HighPin with RL
  uint8_t HiPinRH;    // mask to switch the HighPin with R_H
  uint8_t HiADCp;   // mask to switch the ADC port High-Pin
  uint8_t LoADCp;   // mask to switch the ADC port Low-Pin
  uint8_t HiADCm;   // mask to switch the ADC DDR port High-Pin
  uint8_t LoADCm;   // mask to switch the ADC DDR port Low-Pin
  uint8_t PinMSK;
  uint8_t ii;     // temporary variable

  #ifdef COMMON_EMITTER
    unsigned int tmp16;   // temporary variable
  #else
    #warning "without common emitter hFE"
  #endif

  #if FLASHEND > 0x1fff
    int udiff;
  #endif

  #ifdef COMMON_COLLECTOR
    unsigned long c_hfe;  // amplification factor for common Collector (Emitter follower)
  #endif

  struct resis_t *thisR;
  unsigned long lrx1;
  unsigned long lirx1;
  unsigned long lirx2;

  /*
    switch HighPin directls to VCC 
    switch R_L port for LowPin to GND 
    TristatePin remains switched to input , no action required 
  */

  wdt_reset();
  //#ifdef AUTO_CAL
  //  uint16_t resis680pl;
  //  uint16_t resis680mi;
  //  resis680pl = eeprom_read_word(&R680pl);
  //  resis680mi = eeprom_read_word(&R680mi);
  //  #define RR680PL resis680pl
  //  #define RR680MI resis680mi
  //#else
  //  #define RR680PL (R_L_VAL + PIN_RP)
  //  #define RR680MI (R_L_VAL + PIN_RM)
  //#endif

  LoPinRL = pgm_read_byte(&PinRLtab[LowPin]);   // instruction for LowPin R_L
  LoPinRH = LoPinRL + LoPinRL;        // instruction for LowPin R_H
  TriPinRL = pgm_read_byte(&PinRLtab[TristatePin]); // instruction for TristatePin R_L
  TriPinRH = TriPinRL + TriPinRL;     // instruction for TristatePin R_H
  HiPinRL = pgm_read_byte(&PinRLtab[HighPin]);    // instruction for HighPin R_L
  HiPinRH = HiPinRL + HiPinRL;        // instruction for HighPin R_H

  HiADCp = pgm_read_byte(&PinADCtab[HighPin]);    // instruction for ADC High-Pin 
  LoADCp = pgm_read_byte(&PinADCtab[LowPin]);   // instruction for ADC Low-Pin
  HiADCm = HiADCp | TXD_MSK;
  HiADCp |= TXD_VAL;
  LoADCm = LoADCp | TXD_MSK;
  LoADCp |= TXD_VAL;

  // setting of Pins 
  R_PORT = 0;       // resistor-Port outputs to 0
  R_DDR = LoPinRL;      // Low-Pin to output and across R_L to GND
  ADC_DDR = HiADCm;     // High-Pin to output
  ADC_PORT = HiADCp;      // High-Pin fix to Vcc

  // for some MOSFET the gate (TristatePin) must be discharged
  ChargePin10ms(TriPinRL,0);    // discharge for N-Kanal
  adc.lp_otr = W5msReadADC(LowPin); // read voltage of Low-Pin 
  if (adc.lp_otr >= 977) {    // no current now? 
    ChargePin10ms(TriPinRL,1);    // else: discharge for P-channel (Gate to VCC)
    adc.lp_otr = ReadADC(LowPin); // read voltage of Low-Pin again
  }

  #if DebugOut == 5
    lcd_line2();
    lcd_clear_line();
    lcd_line2();
  #endif

  //if(adc.lp_otr > 92) {  // there is some current without TristatePin current 
  if(adc.lp_otr > 455) {   // there is more than 650uA current without TristatePin current 
    #if DebugOut == 5
      lcd_testpin(LowPin);
      lcd_data('F');
      lcd_testpin(HighPin);
      lcd_space();
      wait_about1s();
    #endif

    // Test if N-JFET or if self-conducting N-MOSFET
    R_DDR = LoPinRL | TriPinRH;   // switch R_H for Tristate-Pin (probably Gate) to GND
    adc.lp1 = W20msReadADC(LowPin); // measure voltage at the assumed Source 
    adc.tp1 = ReadADC(TristatePin); // measure Gate voltage
    R_PORT = TriPinRH;      // switch R_H for Tristate-Pin (probably Gate) to VCC
    adc.lp2 = W20msReadADC(LowPin); // measure voltage at the assumed Source again

    // If it is a self-conducting MOSFET or JFET, then must be: adc.lp2 > adc.lp1 
    if (adc.lp2>(adc.lp1+488)) {
      if (PartFound != PART_FET) {
        // measure voltage at the  Gate, differ between MOSFET and JFET
        ADC_PORT = TXD_VAL;
        ADC_DDR = LoADCm;   // Low-Pin fix to GND
        R_DDR = TriPinRH | HiPinRL; // High-Pin to output
        R_PORT = TriPinRH | HiPinRL;  // switch R_L for High-Pin to VCC
        adc.lp2 = W20msReadADC(TristatePin); // read voltage of assumed Gate 

