mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
        R_DDR = HiPinRL | TriPinRL; // switch R_L port for TristatePin (Gate) to output (GND) => Triac should be triggered 
        if(W5msReadADC(TristatePin) < 977) {
          goto savenresult;     // measure voltage at the Tristate-Pin (probably Gate) ;
                                  // if to low, abort 
        }
    
        if(ReadADC(HighPin) < 733) {
          goto savenresult;     // component has no current => no Triac => abort
        }
    
        R_DDR = HiPinRL;    // TristatePin (Gate) to input 
        if(W5msReadADC(HighPin) < 733) {
          goto savenresult;     // component has no current without base current => no Triac => abort
        }
    
        R_PORT = HiPinRL;   // switch R_L port for HighPin to VCC => switch off holding current 
        wait_about5ms();
        R_PORT = 0;     // switch R_L port for HighPin again to GND; Triac should now switched off
        if(W5msReadADC(HighPin) > 244) {
          goto savenresult;   // measure voltage at the High-Pin (probably A2) ;
                                    // if to high, component is not switched off => no Triac, abort
        }
    
        PartFound = PART_TRIAC;
        PartReady = 1;
        goto savenresult;
      }
    
      // Test if NPN Transistor or MOSFET
      //ADC_DDR = LoADCm;   // Low-Pin to output 0V
      R_DDR = HiPinRL | TriPinRH; // R_H port of Tristate-Pin (Basis) to output
      R_PORT = HiPinRL | TriPinRH;  // R_H port of Tristate-Pin (Basis) to VCC
      wait_about50ms();
      adc.hp2 = ADCconfig.U_AVCC - ReadADC(HighPin);    // measure the voltage at the collector resistor 
      adc.tp2 = ADCconfig.U_AVCC - ReadADC(TristatePin);  // measure the voltage at the base resistor 
    
      #if DebugOut == 5
        lcd_line3();
        lcd_clear_line();
        lcd_line3();
        lcd_data('H');
        lcd_data('P');
        lcd_string(utoa(adc.hp2,outval,10));
        lcd_space();
        lcd_data('T');
        lcd_data('P');
        lcd_string(utoa(adc.tp2,outval,10));
      #endif
    
      if((PartFound == PART_TRANSISTOR) || (PartFound == PART_FET)) {
        PartReady = 1;    // check, if test is already done once
      }
    
      #ifdef COMMON_EMITTER
        trans.uBE[PartReady] = ADCconfig.U_AVCC - adc.tp2 - ReadADC(LowPin);
    
        // compute current amplification factor for common Emitter
        // hFE = B = Collector current / Base current
        if (adc.tp2 < 53) {
    
          #if DebugOut == 5
            lcd_data('<');
            lcd_data('5');
            lcd_data('3');
          #endif
    
          adc.tp2 = 53;
        }
    
        tmp16 = adc.hp2;
        if (tmp16 > adc.lp_otr) {
          tmp16 -= adc.lp_otr;
        }
    
        #ifdef LONG_HFE
          trans.hfe[PartReady] = ((unsigned int)tmp16 * (unsigned long)(((unsigned long)R_H_VAL * 100) / 
                                 (unsigned int)RR680PL)) / (unsigned int)adc.tp2; 
        #else
          trans.hfe[PartReady] = ((tmp16 / ((RR680PL+500)/1000)) * (R_H_VAL/500)) / (adc.tp2/500);
        #endif
      #endif
    
      #ifdef COMMON_COLLECTOR
        // compare current amplification factor for common Collector (Emitter follower)
        // hFE = (Emitterstrom - Basisstrom) / Basisstrom
    
        #ifdef COMMON_EMITTER
          if (c_hfe >  trans.hfe[PartReady]) {
        #endif
            trans.hfe[PartReady] = c_hfe;
            trans.uBE[PartReady] = ADCconfig.U_AVCC - adc.lp1 - adc.tp1;
        #ifdef COMMON_EMITTER
          }
        #endif
      #endif
  //    adc.tp2 = 2600; //#####################################################################################
      if(adc.tp2 > 2557) {    // Basis-voltage R_H is low enough
        PartFound = PART_TRANSISTOR;  // NPN-Transistor is found (Base is near GND)
        PartMode = PART_MODE_NPN;
      } else {        // Basis has low current
        if((adc.lp_otr < 97) && (adc.hp2 > 3400)) {
          // if flow voltage in switched off mode low enough?
          // (since D-Mode-FET will be detected in error as E-Mode )
          PartFound = PART_FET;   // N-Kanal-MOSFET is found (Basis/Gate will Not be pulled down)
          PartMode = PART_MODE_N_E_MOS;
    
          #if DebugOut == 5
            lcd_line3();
            lcd_clear_line();
            lcd_line3();
            lcd_data('N');
            lcd_data('F');
            wait_about1s();
          #endif
    
          // Switching of Drain is monitored with digital input
          // Low level is specified up to 0.3 * VCC
          // High level is specified above 0.6 * VCC
          PinMSK = HiADCm & 7;
    
          // measure Threshold voltage of Gate
          ADMUX = TristatePin | (1<<REFS0); // measure TristatePin, Ref. VCC
          gthvoltage = 1;     // round up ((1*4)/9)
    
          for(ii=0;ii<11;ii++) {
            wdt_reset();
            ChargePin10ms(TriPinRL,0);  // discharge Gate 10ms with RL 
            R_DDR = HiPinRL | TriPinRH; // slowly charge Gate 
            R_PORT = HiPinRL | TriPinRH;
            while ((ADC_PIN&PinMSK)); // Wait, until the MOSFET switch and Drain moved to low 
                                        // 0 is detected with input voltage of 2.12V to 2.24V (tested with mega168 & mega328)
            R_DDR = HiPinRL;    // switch off current
            ADCSRA |= (1<<ADSC);    // start ADC conversion
            while (ADCSRA&(1<<ADSC)); // wait until ADC finished
            gthvoltage += ADCW;   // add result of ADC
          }
    
          gthvoltage *= 4;  // is equal to 44 * ADCW
          gthvoltage /= 9;  // scale to mV
        }
      }

savenresult:
      trans.b = TristatePin;  // save Pin-constellation
      trans.c = HighPin;
      trans.e = LowPin;
    }  // end component conduct => npn

    ADC_DDR = TXD_MSK;    // switch all ADC-Ports to input
    ADC_PORT = TXD_VAL;   // switch all ADC-Ports to 0 (no Pull up)

    // Finish
    // end component has no connection between HighPin and LowPin
    goto widmes;
  }

  // component has current
  // Test if Diode
  ADC_PORT = TXD_VAL;

  for (ii=0;ii<200;ii++) {
    ADC_DDR = LoADCm | HiADCm;    // discharge by short of Low and High side
    wait_about5ms();              // Low and Highpin to GND for discharge
    ADC_DDR = LoADCm;             // switch only Low-Pin fix to GND
    adc.hp1 = ReadADC(HighPin);   // read voltage at High-Pin
    if (adc.hp1 < (150/8)) break;
  }

