mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
    if (cap_val_nF < (1800/18)) return(0xffff);   // capacity lower than 1.8 uF
    //if (cap_val_nF > (1800/18)) {

    // normal ADC-speed, ADC-Clock 8us
    #ifdef ADC_Sleep_Mode
      StartADCmsk = (1<<ADEN) | (1<<ADIF) | (1<<ADIE) | AUTO_CLOCK_DIV;  // enable ADC and Interrupt
      ADCSRA = StartADCmsk;   // enable ADC and Interrupt
    #else
      StartADCmsk =  (1<<ADSC) | (1<<ADEN) | (1<<ADIF) | AUTO_CLOCK_DIV;  // enable and start ADC
    #endif

    //} else {

    // fast ADC-speed, ADC-Clock 2us
    #ifdef ADC_Sleep_Mode
      //StartADCmsk = (1<<ADEN) | (1<<ADIF) | (1<<ADIE) | FAST_CLOCK_DIV;  // enable ADC and Interrupt
      //ADCSRA = StartADCmsk;   // enable ADC and Interrupt
      //SMCR = (1 << SM0) | (1 <<SE); // set ADC Noise Reduction and Sleep Enable
    #else
      //StartADCmsk =  (1<<ADSC) | (1<<ADEN) | (1<<ADIF) | FAST_CLOCK_DIV;  // enable and start ADC
    #endif

    //big_cap = 0;
    //}
  }

  LoADC = pgm_read_byte(&PinADCtab[lopin]) | TXD_MSK;
  HiADC = pgm_read_byte(&PinADCtab[hipin]) | TXD_MSK;
  LoPinR_L = pgm_read_byte(&PinRLtab[lopin]);   // R_L mask for LowPin R_L load
  HiPinR_L = pgm_read_byte(&PinRLtab[hipin]);   // R_L mask for HighPin R_L load

  #if PROCESSOR_TYP == 1280
    // ATmega640/1280/2560 1.1V Reference with REFS0=0
    SelectLowPin = (lopin | (1<<REFS1) | (0<<REFS0)); // switch ADC to LowPin, Internal Ref. 
    SelectHighPin = (hipin | (1<<REFS1) | (0<<REFS0));  // switch ADC to HighPin, Internal Ref. 
  #else
    SelectLowPin = (lopin | (1<<REFS1) | (1<<REFS0)); // switch ADC to LowPin, Internal Ref. 
    SelectHighPin = (hipin | (1<<REFS1) | (1<<REFS0));  // switch ADC to HighPin, Internal Ref. 
  #endif

  // Measurement of ESR of capacitors AC Mode
  sumvolt[0] = 1;   // set sum of LowPin voltage to 1 to prevent divide by zero
  sumvolt[2] = 1;   // clear sum of HighPin voltage with current
                                // offset is about (x*10*200)/34000 in 0.01 Ohm units
  sumvolt[1] = 0;   // clear sum of HighPin voltage without current
  sumvolt[3] = 0;   // clear sum of HighPin voltage without current
  EntladePins();    // discharge capacitor
  ADC_PORT = TXD_VAL;   // switch ADC-Port to GND
  ADMUX = SelectLowPin;   // set Mux input and Voltage Reference to internal 1.1V

  #ifdef NO_AREF_CAP
    wait100us();    // time for voltage stabilization
  #else
    wait_about10ms();   // time for voltage stabilization with 100nF
  #endif

  // start voltage must be negativ
  ADC_DDR = HiADC;      // switch High Pin to GND
  R_PORT = LoPinR_L;      // switch R-Port to VCC
  R_DDR = LoPinR_L;     // switch R_L port for HighPin to output (VCC)
  wait10us();
  wait2us();
  R_DDR = 0;        // switch off current
  R_PORT = 0;
  StartADCwait();     // set ADCSRA Interrupt Mode, sleep

  // Measurement frequency is given by sum of ADC-Reads < 680 Hz for normal ADC speed.
  // For fast ADC mode the frequency is below 2720 Hz (used for capacity value below 3.6 uF).
  // ADC Sample and Hold (SH) is done 1.5 ADC clock number after real start of conversion.
  // Real ADC-conversion is started with the next ADC-Clock (125kHz) after setting the ADSC bit.

  for(ii=0;ii<MAX_CNT;ii++) {
    ADC_DDR = LoADC;      // switch Low-Pin to output (GND)
    R_PORT = LoPinR_L;      // switch R-Port to VCC
    R_DDR = LoPinR_L;     // switch R_L port for LowPin to output (VCC)
    ADMUX = SelectLowPin;
    StartADCwait();     // set ADCSRA Interrupt Mode, sleep
    StartADCwait();     // set ADCSRA Interrupt Mode, sleep
    adcv[0] = ADCW;     // Voltage LowPin with current
    ADMUX = SelectHighPin;

    //if (big_cap != 0) {

    StartADCwait();     // ADCSRA = (1<<ADEN) | (1<<ADIF) | (1<<ADIE) | AUTO_CLOCK_DIV; 
    ADCSRA = (1<<ADSC) | (1<<ADEN) | (1<<ADIF) | AUTO_CLOCK_DIV; // enable ADC and start with ADSC
    wait4us();
    R_PORT = HiPinR_L;      // switch R-Port to VCC
    R_DDR = HiPinR_L;     // switch R_L port for HighPin to output (VCC)
    DelayBigCap();      // wait predefined time

    //} else {
    //  StartADCwait();     // ADCSRA = (1<<ADEN) | (1<<ADIF) | (1<<ADIE) | AUTO_CLOCK_DIV; 
    //  R_PORT = HiPinR_L;    // switch R-Port to VCC
    //  R_DDR = HiPinR_L;   // switch R_L port for HighPin to output (VCC)
    //  ADCSRA = (1<<ADSC) | (1<<ADEN) | (1<<ADIF) | FAST_CLOCK_DIV;  // enable ADC and start with ADSC
    //                      // SH at 2.5 ADC clocks behind start = 5 us
    //  DelaySmallCap();    // wait predefined time
    //}

    R_DDR = 0;        // switch current off,  SH is 1.5 ADC clock behind real start
    R_PORT = 0;
    while (ADCSRA&(1<<ADSC));   // wait for conversion finished
    adcv[1] = ADCW;     // Voltage HighPin with current

    #ifdef ADC_Sleep_Mode
      ADCSRA = StartADCmsk;   // enable ADC and Interrupt
    #endif

    wdt_reset();

    // ******** Reverse direction, connect High side with GND ********
    ADC_DDR = HiADC;      // switch High Pin to GND
    R_PORT = HiPinR_L;      // switch R-Port to VCC
    R_DDR = HiPinR_L;     // switch R_L port for HighPin to output (VCC)
    wdt_reset();
    ADMUX = SelectHighPin;
    StartADCwait();     // set ADCSRA Interrupt Mode, sleep
    StartADCwait();     // set ADCSRA Interrupt Mode, sleep
    adcv[2] = ADCW;     // Voltage HighPin with current
    ADMUX = SelectLowPin;

    //if (big_cap != 0) {

    StartADCwait();     // set ADCSRA Interrupt Mode, sleep
    ADCSRA = (1<<ADSC) | (1<<ADEN) | (1<<ADIF) | AUTO_CLOCK_DIV; // enable ADC and start with ADSC
    wait4us();
    R_PORT = LoPinR_L;
    R_DDR = LoPinR_L;     // switch LowPin with 680 Ohm to VCC
    DelayBigCap();      // wait predefined time

    //} else {
    //  StartADCwait();     // set ADCSRA Interrupt Mode, sleep
    //  R_PORT = LoPinR_L;
    //  R_DDR = LoPinR_L;   // switch LowPin with 680 Ohm to VCC
    //  ADCSRA = (1<<ADSC) | (1<<ADEN) | (1<<ADIF) | FAST_CLOCK_DIV;  // enable ADC and start with ADSC
    //                        // 2.5 ADC clocks = 5 us
    //   DelaySmallCap();     // wait predefined time
    //}

