mausi-mick/KS_ESP32/ardutester-i2c-NANO_Tx_D2-7_for_EBC_01.ino
  //--------------------------------------------
  ADCconfig.U_AVCC = U_VCC;     // set initial VCC Voltage
  ADCconfig.Samples = 190;  // set number of ADC reads near to maximum

  #if FLASHEND > 0x1fff
    ADC_PORT = TXD_VAL;                 // switch to 0V
    ADC_DDR = (1<<TPREF) | TXD_MSK;     // switch pin with 2.5V reference to GND
    wait1ms();
    ADC_DDR =  TXD_MSK;       // switch pin with reference back to input
    trans.uBE[1] = W5msReadADC(TPREF);  // read voltage of 2.5V precision reference

    if ((trans.uBE[1] > 2250) && (trans.uBE[1] < 2750)) {
      // precision voltage reference connected, update U_AVCC
      WithReference = 1;
      ADCconfig.U_AVCC = (unsigned long)((unsigned long)ADCconfig.U_AVCC * 2495) / trans.uBE[1];
    }
  #endif

  #ifdef WITH_AUTO_REF
    (void) ReadADC(MUX_INT_REF);  // read reference voltage 
    ref_mv = W5msReadADC(MUX_INT_REF);  // read reference voltage 
    RefVoltage();     // compute RHmultip = f(reference voltage)
  #else
    ref_mv = DEFAULT_BAND_GAP;      // set to default Reference Voltage
  #endif
 
  ADCconfig.U_Bandgap = ADC_internal_reference; // set internal reference voltage for ADC

  //--------------------------------------------

  #ifdef AUTO_CAL
    // measurement of internal resistance of the ADC port outputs switched to GND
    ADC_DDR = 1<<TP1 | TXD_MSK;   // ADC-Pin  1 to output 0V
    R_PORT = 1<<(TP1*2);    // R_L-PORT 1 to VCC
    R_DDR = 1<<(TP1*2);     // Pin 1 to output and over R_L to VCC
    sum_rm = W5msReadADC(TP1);

    ADC_DDR = 1<<TP2 | TXD_MSK;   // ADC-Pin 2 to output 0V
    R_PORT =  1<<(TP2*2);   // R_L-PORT 2 to VCC
    R_DDR = 1<<(TP2*2);     // Pin 2 to output and over R_L to VCC
    sum_rm += W5msReadADC(TP2);

    ADC_DDR = 1<<TP3 | TXD_MSK;   // ADC-Pin 3 to output 0V
    R_PORT =  1<<(TP3*2);   // R_L-PORT 3 to VCC
    R_DDR = 1<<(TP3*2);     // Pin 3 to output and over R_L to VCC
    sum_rm += W5msReadADC(TP3);   // add all three values

    // measurement of internal resistance of the ADC port output switched to VCC
    R_PORT = 0;       // R-Ports to GND
    ADC_PORT = 1<<TP1 | TXD_VAL;  // ADC-Port 1 to VCC
    ADC_DDR = 1<<TP1 | TXD_MSK;   // ADC-Pin  1 to output 0V
    R_DDR = 1<<(TP1*2);     // Pin 1 to output and over R_L to GND
    sum_rp = ADCconfig.U_AVCC - W5msReadADC(TP1);
      
    ADC_PORT = 1<<TP2 | TXD_VAL;  // ADC-Port 2 to VCC
    ADC_DDR = 1<<TP2 | TXD_MSK;   // ADC-Pin  2 to output 0V
    R_DDR = 1<<(TP2*2);     // Pin 2 to output and over R_L to GND
    sum_rp += ADCconfig.U_AVCC - W5msReadADC(TP2);

    ADC_PORT = 1<<TP3 | TXD_VAL;  // ADC-Port 3 to VCC
    ADC_DDR = 1<<TP3 | TXD_MSK;   // ADC-Pin  3 to output 0V
    R_DDR = 1<<(TP3*2);     // Pin 3 to output and over R_L to GND
    sum_rp += ADCconfig.U_AVCC - W5msReadADC(TP3);

    u680 = ((ADCconfig.U_AVCC * 3) - sum_rm - sum_rp);  // three times the voltage at the 680 Ohm
    pin_rmi = (unsigned long)((unsigned long)sum_rm * (unsigned long)R_L_VAL) / (unsigned long)u680;
    //adcmv[2] = pin_rm;  // for last output in row 2
    pin_rpl = (unsigned long)((unsigned long)sum_rp * (unsigned long)R_L_VAL) / (unsigned long)u680;
    resis680pl = pin_rpl + R_L_VAL;
    resis680mi = pin_rmi + R_L_VAL;
  #endif

  ADCconfig.Samples = ANZ_MESS;   // set to configured number of ADC samples
} 
 
/* -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- -=- */

// Interfacing a HD44780 compatible LCD with 4-Bit-Interface mode


void lcd_set_cursor(uint8_t row, uint8_t col)
{
  int row_offsets[] = { 0x00, 0x40, 0x14, 0x54 };
  if ( row >= 2 ) {
    row = 1;
  }
  lcd_command(CMD_SetDDRAMAddress | (col + row_offsets[row]));
 // uart_newline();  //nl
}

void lcd_string(char *data) {
  while(*data) {
    lcd_data(*data);
    data++;
  }
}

void lcd_pgm_string(const unsigned char *data) {
  unsigned char cc;
  while(1) {
    cc = pgm_read_byte(data);
    if((cc == 0) || (cc == 128)) return;
    lcd_data(cc);
    data++;
  }
}

void lcd_pgm_custom_char(uint8_t location, const unsigned char *chardata) { 
  location &= 0x7;
  lcd_command(CMD_SetCGRAMAddress | (location << 3));
  for(uint8_t i=0;i<8;i++) {
    lcd.write(pgm_read_byte(chardata));
    chardata++;
  }
}

// sends numeric character (Pin Number) to the LCD 
// from binary 0 we send ASCII 1
void lcd_testpin(unsigned char temp) {
  lcd_data(temp + '1');
}

// send space character to LCD
void lcd_space(void) {
  lcd_data(' ');
}

void lcd_fix_string(const unsigned char *data) {
  unsigned char cc;
  while(1) {
    cc = MEM_read_byte(data);
    if((cc == 0) || (cc == 128)) return;
    lcd_data(cc);
    data++;
  }
}

// sends data byte to the LCD 
void lcd_data(unsigned char temp1) {
  lcd.write(temp1);

  switch(temp1) {
    case LCD_CHAR_DIODE1: {
      uart_putc('>'); uart_putc('|'); break;
    }
    case LCD_CHAR_DIODE2: {
      uart_putc('|'); uart_putc('<'); break;
    }
    case LCD_CHAR_CAP: {
      uart_putc('|'); uart_putc('|'); break;
    }
    case LCD_CHAR_RESIS1:
    case LCD_CHAR_RESIS2: {
      uart_putc('R'); break;
    }
    case LCD_CHAR_U: {    // micro
      uart_putc('u');   // ASCII u
      break;
    }
    case LCD_CHAR_OMEGA: {  // Omega
      uart_putc('o');           // "ohm"
      uart_putc('h');
      uart_putc('m'); break;
    }
    default: {
      uart_putc(temp1);
    }
  }
}

void lcd_clear(void) {
  lcd.clear();
// uart_newline(); //nl
}


void uart_putc(uint8_t data) {
 // Serial.write(data); //###################################################################
  delay(2);
}

void uart_putx(uint8_t data) {
  Serial.write(data); //###################################################################
  delay(2);
}
